---
kind: property
id: P:Autodesk.Revit.DB.Visual.Hardwood.HardwoodFinish
source: html/11e71147-9fbe-c5b0-0e21-8d39cf375ce3.htm
---
# Autodesk.Revit.DB.Visual.Hardwood.HardwoodFinish Property

The property labeled "Finish" from the "Hardwood" schema.

## Syntax (C#)
```csharp
public static string HardwoodFinish { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "HardwoodFinishType".